Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NoSurfPatternOnSite
Topographical surfaces do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated surface.